app/controllers/assets_controller.rb

SELECT * FROM "assets"
---
  def index
    @assets = Asset.all

SELECT * FROM "assets" WHERE ("assets"."id" = 0)
---
  def show
    @asset = Asset.find(params[:id])

SELECT * FROM "assets" WHERE ("assets"."id" = 1)
---
  def edit
    @asset = Asset.find(params[:id])

INSERT INTO "assets" ("reference", "created_at", "cost", "date_installed", "updated_at", "i_t_asset", "room") VALUES('3245', '2011-02-21 13:44:19', '£120', '2011-02-21', '2011-02-21 13:44:19', 'LG Monitor', '515')
---
  def create
    @asset = Asset.new(params[:asset])

    respond_to do |format|
      if @asset.save

SELECT * FROM "assets" WHERE ("assets"."id" = 4)
DELETE FROM "assets" WHERE "id" = 4
---
  def destroy
    @asset = Asset.find(params[:id])
    @asset.destroy