app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username", "password_salt", "password_hash", "email") VALUES('2011-02-18 13:53:45', '2011-02-18 13:53:45', 'enrstuff', 'da68d76c2c864796e2a240ff8c8841747acc13c6', '5d91863cac0a6b1850140db643b20efcf3bfd1af', 's.w.tuffy@ljmu.ac.uk')